SimuXAI/blog1/sprayFoam_twoWayCoupled/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    sides
    {
        type            patch;
        nFaces          50000;
        startFace       2970000;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          10000;
        startFace       3020000;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
10000
(
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
...
)
;
    }
)

// ************************************************************************* //
