SimuXAI/blog1/sprayFoam_twoWayCoupled/constant/foam.inp
species
(
    O2
    H2O
    N2
)
;

reactions
{}
